In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
dates = pd.date_range('20130101', periods=6)

In [4]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [6]:
df

                   A         B         C         D
2013-01-01  1.788562  1.310629  0.490264 -2.199162
2013-01-02  0.548250  1.478336 -1.574504 -0.207442
2013-01-03 -0.747840 -1.277288  0.611520 -0.434700
2013-01-04  0.345954  1.540147 -1.403746 -2.919118
2013-01-05 -0.771694 -0.728619  1.053139 -0.559771
2013-01-06  0.890737 -0.705576  1.631122 -0.607558

In [7]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [8]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [14]:
df1

                   A         B         C         D    E
2013-01-01  1.788562  1.310629  0.490264 -2.199162  1.0
2013-01-02  0.548250  1.478336 -1.574504 -0.207442  1.0
2013-01-03 -0.747840 -1.277288  0.611520 -0.434700  NaN
2013-01-04  0.345954  1.540147 -1.403746 -2.919118  NaN

In [16]:
df1.fillna(value = 5) # 결측치 채워넣기

                   A         B         C         D    E
2013-01-01  1.788562  1.310629  0.490264 -2.199162  1.0
2013-01-02  0.548250  1.478336 -1.574504 -0.207442  1.0
2013-01-03 -0.747840 -1.277288  0.611520 -0.434700  5.0
2013-01-04  0.345954  1.540147 -1.403746 -2.919118  5.0

In [17]:
df1.dropna(how='any') # 결측치를 가지고 있는 행을 지움

                   A         B         C         D    E
2013-01-01  1.788562  1.310629  0.490264 -2.199162  1.0
2013-01-02  0.548250  1.478336 -1.574504 -0.207442  1.0

In [18]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True